// Було дуже велике і сильне використання чистого JS HTML CSS.
// JQuery використовувався лише для анімацій та деяких ефектів.

// MPA - Multiple Page Application - весь сайт завантажується повністю, без виключень!
// Кожна сторінка була окремим HTML файлом.
// Перехід між сторінками здійснювався за допомогою посилань.

// SPA - Single Page Application - весь сайт завантажується один раз.
// Твій комп'ютер завантажує лишень один єдиний HTML файл.
// нам потрібно змінювати вміст сторінки динамічно за допомогою JavaScript відповідно до потреб нашого користувача!

// тоді почали з'являтися натяки на створення святої трійці форнт енд розробки:
//Angular.js. - Google (Angular v21))
// React.js -` Facebook
// Vue.js - Evan You.
