import CartoonInfo from "./cartoon-info/CartoonInfo";

export default function Main() {
	return (
		<>
			<main>
				<div className="seriesInfo">
					<CartoonInfo
						title="Сімпсони українською мовою онлайн"
						description="Привітулі! Ви знаходитеся на сторінці, де можна подивитися всі сезони улюбленого мультсеріалу. Кожна серія - шедевр. Епізоди можна передивлятися не один раз. Якщо ви тільки почали дивитися Сімпсонів, то попереду вас чекають неймовірно цікаві історії, і ми навіть заздримо вам, тому що перший перегляд серій має надзвичайну атмосферу. А якщо ви дивитеся не перший раз, то ми вас прекрасненько розуміємо. Всі разом ми є великою сім'єю, яку називаємо «Сімпсонятами». Отже, сімпсонята, бажаємо приємного перегляду! :)"
					/>
				</div>
				<div className="episodesList">
					{/* тут повинен бути список серій мультика */}
				</div>
			</main>
			<aside></aside>
		</>
	);
}
