import "./Info1.css";

export default function Info1() {
	return (
		<div className="info1">
			<h1 className="title">Невколупний / Невразливий українською мовою онлайн</h1>
			<p>
				Історія про 17-річного Марка Грейсона, який є сином наймогутнішого супергероя. Хлопчині належить успадкувати та опанувати надздібності батька, щоб скеровувати свою енергію у правильне русло, адже світ вже ніколи не буде у безпеці. Так, саме його називатимуть Невколупний чи Невразливий українською мовою і все це онлайн.
			</p>
		</div>
	);
}
