// Гітхаб і навіщо він потрібен
// потрібен він для того щоб зберігати свої проекти та мати можливість співпрацювати над одним проектом з іншими людьми
// також він допомагає відслідковувати зміни в коді і повертатися до попередніх версій якщо щось пішло не так

// Що таке репозиторій
// Репозиторій це місце де зберігається весь код проекту разом з історією змін - це як папка на комп'ютері але з додатковими можливостями для відслідковування змін в коді який ми пишемо!

// Репозиторій можна створити на гітхабі або локально на своєму комп'ютері

// цього уроку ми будемо підключатися до віддаленого репозиторію і відправляти туди свої зміни

// Для початку ми повинні зайти в нашу папку реакт-проєкту
// Відкриваємо термінал і вводимо команду:
// cd ITSchool () для прикладу

// 2. Ініціалізація гіта в нашому проєкті
// Вводимо команду:
// git init
// Ця команда створить приховану папку .git в якій будуть зберігатися всі дані про наш репозиторій
// 3. клонуємо проект з гітхабу
// Для того щоб скопіювати проект з гітхабу на свій комп'ютер ми повинні його клонувати
// заходимо на репозиторій, натискаємо на кнопку "Code" і копіюємо посилання
//потім повертаємося в термінал і починаємо клонувати репозиторій
// Для цього вводимо команду:
// git clone посилання_на_репозиторій

// Коли репозиторій склонується у нас на комп'ютері з'явиться папка з назвою репозиторію в якій буде весь код проекту

// 4. Відправляємо зміни на гітхаб
//для того щоб закидувати ми переходимо в наш проект - папка яка завантажилась (переходимо в терміналі(cd назва_папки))
// після того вводимо команду git add .
// ця команда відслідковує всі зміни які ми зробили в проекті
// потім вводимо команду git commit -m 'перше завантаження проекту'
// ця команда створює коміт з повідомленням яке ми вказали в лапках
// нарешті вводимо команду git push
// ця команда відправляє наші зміни на гітхаб
// Тепер якщо ми зайдемо на гітхаб ми побачимо що наші зміни з'явилися в репозиторії

