// 1. Масив із 3 улюбленими іграми
let games = ["Minecraft", "CS:GO", "FIFA"];

// 2. Масив із 5 кольорів
let colors = ["червоний", "синій", "зелений", "жовтий", "чорний"];

// 3. Масив із числами від 1 до 10
let numbers1to10 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

// 4. Масив із 3 друзями
let friends = ["Андрій", "Оля", "Максим"];

// 5. Масив із назвами 4 міст України
let cities = ["Київ", "Львів", "Одеса", "Харків"];

// 6. Порожній масив myArray
let myArray = [];

// 7. Масив weekDays з днями тижня
let weekDays = [
  "Понеділок",
  "Вівторок",
  "Середа",
  "Четвер",
  "П’ятниця",
  "Субота",
  "Неділя",
];

// 8. Масив із 3 предметів у школі
let subjects = ["Математика", "Інформатика", "Українська мова"];

// 9
let mixedArray = [10, 25, "Привіт"];

// 10
let oneNumber = [100];

// 11
let pets = ["Барсик", "Рекс"];

// 12
let seasons = ["Зима", "Весна", "Літо", "Осінь"];

// 13
let numbers10to15 = [10, 11, 12, 13, 14, 15];

// 14
let numbers = [7, 42, 100];

// 15
let foods = ["Піца", "Борщ", "Суші", "Бургери"];

// 16
let cars = ["BMW", "Audi", "Tesla"];

// 17
let sports = ["Футбол", "Баскетбол", "Теніс", "Плавання", "Волейбол"];

// 18
let languages = ["Українська", "Англійська"];

// 19.
let evenNumbers = [2, 4, 6, 8, 10, 12];
