import "./Info.css";

export default function Info() {
	return (
		<div className="info">
			<h1>Футурама українською мовою онлайн</h1>
			<p>
				Доставщик піци Фрай потрапляє у майбутнє - в 3000-й рік, де його
				чекають вірні друзі в особі божевільного робота Бендера і
				одноокої Ліли. У кожній серії мультсеріалу «Футурама»
				українською представлені нові пригоди цієї компанії. Дуже скоро
				Фрай переконується, що роботу кур'єра в міжпланетному варіанті
				нецікавою ніяк не назвати - герої доставляють вантажі на інші
				планети, постійно ризикуючи при цьому здоров'ям, а то й життям.
				Але і крім роботи в їхніх долях відбувається чимало важливого.
			</p>
		</div>
	);
}
